src/ex_Tabakon/Reports/ТБКОтчетОстаткиВРознице.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>ТБКОтчетОстаткиВРознице</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоЗатяжек</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьУсловинеНаЦену</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗнакУсловиня</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/ex_Tabakon/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Штрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Владелец</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ex_Tabakon/AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/ex_Tabakon/InformationRegisters/ТБК_ЖурналСканированияШК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТБК_ЖурналСканированияШК</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Найдено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтрихкодEAN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ex_Tabakon/Reports/ТБКОтчетОстаткиВРознице/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ФормаНастройки.Видимость            = Ложь;
	Элементы.ФормаСтандартныеНастройки.Видимость = Ложь;
	Элементы.ФормаИзменитьВариант.Видимость      = Ложь;
	Элементы.ФормаВарианты.Видимость             = Ложь;
	Элементы.ФормаИзменитьФорму.Видимость        = Ложь;

	Элементы.ЗнакУсловиня.СписокВыбора.Добавить("<=");
	Элементы.ЗнакУсловиня.СписокВыбора.Добавить(">=");
	Элементы.ЗнакУсловиня.СписокВыбора.Добавить("=");

	Отчет.ЗнакУсловиня = "<=";

	//Марк 2026-09-07 сканирование штрихкодов ++
	КнопкаСформировать = Элементы.Найти("ФормаСформировать");
	Если КнопкаСформировать <> Неопределено Тогда
		КнопкаСформировать.Видимость = Ложь;
	КонецЕсли;

	ТБК_Магазин = ОбщегоНазначения.ПолучитьМагазинИзООРП();
	//Марк 2026-09-07 --

КонецПроцедуры

//Марк 2026-09-07 сканирование штрихкодов ++

#Область СканированиеШтрихкодов

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ИспользоватьПодключаемоеОборудование = Истина;
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода");

КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)

	Если Событие = "Штрихкод" Или Событие = "ПолученШтрихкод" Тогда

		ДанныеСоСканераСтруктура = СобытияФормИСКлиент.ВнешнееСобытиеПреобразоватьДанныеСоСканераВСтруктуру(
			ЭтотОбъект,
			Источник,
			Событие,
			Данные);

		Если ДанныеСоСканераСтруктура = Неопределено Тогда
			Возврат;
		КонецЕсли;

		ТБК_ОбработатьСканирование(ДанныеСоСканераСтруктура.Штрихкод);

	КонецЕсли;

КонецПроцедуры

// Сканирование целиком: сервер перестраивает отчет и возвращает, в какой ячейке
// оказался отсканированный товар, клиент ставит туда курсор. Позиционирование
// делается и при повторном скане - продавец видит, что товар уже в списке.
&НаКлиенте
Процедура ТБК_ОбработатьСканирование(Штрихкод)

	ПозицияВОтчете = ОбработатьСканированиеНаСервере(Штрихкод);

	Если ПозицияВОтчете = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Попытка
		Элементы.Результат.ТекущаяОбласть = Результат.Область(ПозицияВОтчете.Строка, ПозицияВОтчете.Колонка);
	Исключение
		// Не встали на строку - не повод ронять сканирование.
	КонецПопытки;

КонецПроцедуры

// Первое сканирование после "Сформировать" начинает список с нуля: кнопка его чистит.
// Каждое следующее сканирование только добавляет товар и переформировывает отчет.
&НаСервере
Функция ОбработатьСканированиеНаСервере(Штрихкод)

	Штрихкод = СокрЛП(Штрихкод);
	Если ПустаяСтрока(Штрихкод) Тогда
		Возврат Неопределено;
	КонецЕсли;

	ДанныеШК = ТБК_НайтиНоменклатуруПоШтрихкоду(Штрихкод);

	ТБК_ЗаписатьВЖурналСканирования(Штрихкод, ДанныеШК, ТБК_Магазин);

	Если НЕ ДанныеШК.Найдено Тогда
		Сообщить("Товар по штрихкоду не найден: " + Штрихкод);
		Возврат Неопределено;
	КонецЕсли;

	Отбор = Новый Структура("Номенклатура", ДанныеШК.Номенклатура);
	Если ТБК_ОтсканированныеТовары.НайтиСтроки(Отбор).Количество() = 0 Тогда
		НоваяСтрока = ТБК_ОтсканированныеТовары.Добавить();
		НоваяСтрока.Номенклатура   = ДанныеШК.Номенклатура;
		НоваяСтрока.Характеристика = ДанныеШК.Характеристика;
		НоваяСтрока.Штрихкод       = Штрихкод;
	КонецЕсли;

	Возврат ТБК_СформироватьНаСервере(Истина, ДанныеШК.Номенклатура);

КонецФункции

&НаКлиенте
Процедура ТБК_Сформировать(Команда)

	ТБК_СформироватьПоОтборамНаСервере();

КонецПроцедуры

&НаСервере
Процедура ТБК_СформироватьПоОтборамНаСервере()

	ТБК_ОтсканированныеТовары.Очистить();
	ТБК_СформироватьНаСервере(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ТБК_ОчиститьСканирование(Команда)

	ТБК_ОчиститьСканированиеНаСервере();

КонецПроцедуры

&НаСервере
Процедура ТБК_ОчиститьСканированиеНаСервере()

	ТБК_ОтсканированныеТовары.Очистить();
	Результат.Очистить();

КонецПроцедуры

// Компоновка своими руками. Платформенную "Сформировать" не используем,
// см. комментарий в ПриСозданииНаСервере.
//
// Возвращаемое значение:
//  Структура, Неопределено - Строка и Колонка ячейки с НоменклатураДляПозиционирования.
//
&НаСервере
Функция ТБК_СформироватьНаСервере(ПоШтрихкодам, НоменклатураДляПозиционирования = Неопределено)

	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");

	СписокНоменклатуры = Новый СписокЗначений;
	Если ПоШтрихкодам Тогда
		Для Каждого СтрокаТовара Из ТБК_ОтсканированныеТовары Цикл
			Если СписокНоменклатуры.НайтиПоЗначению(СтрокаТовара.Номенклатура) = Неопределено Тогда
				СписокНоменклатуры.Добавить(СтрокаТовара.Номенклатура);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Настройки = ОтчетОбъект.КомпоновщикНастроек.ПолучитьНастройки();
	ОтчетОбъект.ТБК_УстановитьПараметрыКомпоновки(Настройки, ПоШтрихкодам, СписокНоменклатуры);

	ДанныеРасшифровкиОбъект = Новый ДанныеРасшифровкиКомпоновкиДанных;

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(
		ОтчетОбъект.СхемаКомпоновкиДанных,
		Настройки,
		ДанныеРасшифровкиОбъект);

	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровкиОбъект, Истина);

	ДокументРезультат = Новый ТабличныйДокумент;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);

	Результат = ДокументРезультат;
	ДанныеРасшифровки = ПоместитьВоВременноеХранилище(ДанныеРасшифровкиОбъект, УникальныйИдентификатор);

	Если НЕ ЗначениеЗаполнено(НоменклатураДляПозиционирования) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат ТБК_ПозицияНоменклатурыВРезультате(ДокументРезультат, НоменклатураДляПозиционирования);

КонецФункции

&НаСервереБезКонтекста
Функция ТБК_ПозицияНоменклатурыВРезультате(ДокументРезультат, Номенклатура)

	ТекстПоиска = СокрЛП(Номенклатура.НаименованиеПолное);
	Если ПустаяСтрока(ТекстПоиска) Тогда
		Возврат Неопределено;
	КонецЕсли;

	ЗапаснаяПозиция = Неопределено;

	Для НомерСтроки = 1 По ДокументРезультат.ВысотаТаблицы Цикл
		Для НомерКолонки = 1 По ДокументРезультат.ШиринаТаблицы Цикл

			ТекстЯчейки = СокрЛП(ДокументРезультат.Область(НомерСтроки, НомерКолонки).Текст);

			Если ТекстЯчейки = ТекстПоиска Тогда
				Возврат Новый Структура("Строка, Колонка", НомерСтроки, НомерКолонки);
			ИначеЕсли ЗапаснаяПозиция = Неопределено
				И НЕ ПустаяСтрока(ТекстЯчейки)
				И СтрНайти(ТекстЯчейки, ТекстПоиска) > 0 Тогда
				ЗапаснаяПозиция = Новый Структура("Строка, Колонка", НомерСтроки, НомерКолонки);
			КонецЕсли;

		КонецЦикла;
	КонецЦикла;

	Возврат ЗапаснаяПозиция;

КонецФункции

&НаСервереБезКонтекста
Функция ТБК_НайтиНоменклатуруПоШтрихкоду(Штрихкод)

	ДанныеШК = Новый Структура;
	ДанныеШК.Вставить("Найдено"       , Ложь);
	ДанныеШК.Вставить("Номенклатура"  , Справочники.Номенклатура.ПустаяСсылка());
	ДанныеШК.Вставить("Характеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	ДанныеШК.Вставить("ШтрихкодEAN"   , "");
	ДанныеШК.Вставить("Остаток"       , 0);

	ШтрихкодПоиска = Штрихкод;

	Если СтрДлина(Штрихкод) > 28 Тогда //это маркировка
		КодМаркировки = Штрихкод;
		ШтрихкодПоиска = ШтрихкодированиеИС.ТБКEANИзКодаМаркировки(КодМаркировки);
		Если НЕ ЗначениеЗаполнено(ШтрихкодПоиска) Тогда
			ШтрихкодПоиска = ТБК_ПолучитьЕАН(Штрихкод);
		КонецЕсли;
	КонецЕсли;

	ДанныеШК.ШтрихкодEAN = ШтрихкодПоиска;

	Если НЕ ЗначениеЗаполнено(ШтрихкодПоиска) Тогда
		Возврат ДанныеШК;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Штрихкоды.Владелец КАК Владелец,
	|	Штрихкоды.Характеристика КАК Характеристика
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Штрихкод = &Штрихкод
	|	И Штрихкоды.Владелец ССЫЛКА Справочник.Номенклатура";

	ВариантыПоиска = Новый Массив;
	ВариантыПоиска.Добавить(ШтрихкодПоиска);
	ВариантыПоиска.Добавить("0" + ШтрихкодПоиска);
	ВариантыПоиска.Добавить("00000" + ШтрихкодПоиска);

	Для Каждого ВариантШК Из ВариантыПоиска Цикл

		Запрос.УстановитьПараметр("Штрихкод", ВариантШК);
		Выборка = Запрос.Выполнить().Выбрать();

		Если Выборка.Следующий() Тогда
			ДанныеШК.Найдено        = Истина;
			ДанныеШК.Номенклатура   = Выборка.Владелец;
			ДанныеШК.Характеристика = Выборка.Характеристика;
			ДанныеШК.ШтрихкодEAN    = ВариантШК;
			Прервать;
		КонецЕсли;

	КонецЦикла;

	Если ДанныеШК.Найдено Тогда
		ДанныеШК.Остаток = ТБК_ОстатокНоменклатуры(ДанныеШК.Номенклатура);
	КонецЕсли;

	Возврат ДанныеШК;

КонецФункции

&НаСервереБезКонтекста
Функция ТБК_ОстатокНоменклатуры(Номенклатура)

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток) КАК Остаток
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыНаСкладах.Остатки(, Номенклатура = &Номенклатура) КАК ТоварыНаСкладахОстатки");
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Остаток) Тогда
		Возврат Выборка.Остаток;
	КонецЕсли;

	Возврат 0;

КонецФункции

&НаСервереБезКонтекста
Функция ТБК_ПолучитьЕАН(ШК)

	Если Лев(ШК, 3) = "010" Тогда
		ШК = Сред(СокрЛП(ШК), 4);
	КонецЕсли;

	Если Лев(ШК, 5) = "00000" Тогда
		флЭтоЕан8 = Истина;
	Иначе
		флЭтоЕан8 = Ложь;
	КонецЕсли;

	ШК = ОбщегоНазначенияВызовСервера.УдалитьЛидирующиеНули(ШК);

	ШК = Лев(ШК, 13);

	Если флЭтоЕан8 Тогда
		ШК = Лев(ШК, 8);
	Иначе
		Попытка
			ФФФ = Число(ШК);
		Исключение
			ШК = Лев("0" + ШК, 13);
		КонецПопытки;
	КонецЕсли;

	Возврат ШК;

КонецФункции

&НаСервереБезКонтекста
Процедура ТБК_ЗаписатьВЖурналСканирования(Штрихкод, ДанныеШК, Магазин)

	Попытка

		УстановитьПривилегированныйРежим(Истина);

		Запись = РегистрыСведений.ТБК_ЖурналСканированияШК.СоздатьМенеджерЗаписи();
		Запись.Дата           = ТекущаяДата();
		Запись.Пользователь   = Пользователи.ТекущийПользователь();
		Запись.Штрихкод       = Штрихкод;
		Запись.Номенклатура   = ДанныеШК.Номенклатура;
		Запись.Характеристика = ДанныеШК.Характеристика;
		Запись.Остаток        = ДанныеШК.Остаток;
		Запись.Найдено        = ДанныеШК.Найдено;
		Запись.ШтрихкодEAN    = ДанныеШК.ШтрихкодEAN;
		Запись.Магазин        = Магазин;
		Запись.Источник       = "ТБКОтчетОстаткиВРознице";
		Запись.Записать();

	Исключение
		Сообщить("Не удалось записать сканирование в журнал: " + ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

#КонецОбласти
//Марк 2026-09-07 --
